
## Plan Result (terraform/aws/palserver)

[CI link](https://github.com/boxp/arch/actions/runs/8269511848)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 21 to destroy.</code></pre>

* Create
  * aws_ecr_repository.palserver
  * aws_kms_key.ecr_kms
* Delete
  * aws_iam_role_policy_attachment.terraform_apply_admin
  * aws_iam_role_policy_attachment.terraform_plan_readonly
  * aws_iam_role_policy_attachment.tfmigrate_apply_readonly
  * aws_iam_role_policy_attachment.tfmigrate_plan_readonly
  * module.aws.aws_iam_policy.put_terraform_state[0]
  * module.aws.aws_iam_policy.put_tfmigrate_history
  * module.aws.aws_iam_policy.read_terraform_state[0]
  * module.aws.aws_iam_policy.read_tfmigrate_history
  * module.aws.aws_iam_role.terraform_apply
  * module.aws.aws_iam_role.terraform_plan
  * module.aws.aws_iam_role.tfmigrate_apply
  * module.aws.aws_iam_role.tfmigrate_plan
  * module.aws.aws_iam_role_policy_attachment.terraform_apply_put_terraform_state[0]
  * module.aws.aws_iam_role_policy_attachment.terraform_apply_read_terraform_state[0]
  * module.aws.aws_iam_role_policy_attachment.terraform_plan_read_terraform_state[0]
  * module.aws.aws_iam_role_policy_attachment.tfmigrate_apply_put_terraform_state[0]
  * module.aws.aws_iam_role_policy_attachment.tfmigrate_apply_put_tfmigrate_history
  * module.aws.aws_iam_role_policy_attachment.tfmigrate_apply_read_terraform_state[0]
  * module.aws.aws_iam_role_policy_attachment.tfmigrate_apply_read_tfmigrate_history
  * module.aws.aws_iam_role_policy_attachment.tfmigrate_plan_read_terraform_state[0]
  * module.aws.aws_iam_role_policy_attachment.tfmigrate_plan_read_tfmigrate_history


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecr_repository.palserver will be created
  + resource "aws_ecr_repository" "palserver" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "palserver"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_iam_role_policy_attachment.terraform_apply_admin will be destroyed
  # (because aws_iam_role_policy_attachment.terraform_apply_admin is not in configuration)
  - resource "aws_iam_role_policy_attachment" "terraform_apply_admin" {
      - id         = "GitHubActions_Terraform_AWS_terraform_apply-20240310074515186500000003" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess" -> null
      - role       = "GitHubActions_Terraform_AWS_terraform_apply" -> null
    }

  # aws_iam_role_policy_attachment.terraform_plan_readonly will be destroyed
  # (because aws_iam_role_policy_attachment.terraform_plan_readonly is not in configuration)
  - resource "aws_iam_role_policy_attachment" "terraform_plan_readonly" {
      - id         = "GitHubActions_Terraform_AWS_terraform_plan-20240310074515203600000004" -> null
      - policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess" -> null
      - role       = "GitHubActions_Terraform_AWS_terraform_plan" -> null
    }

  # aws_iam_role_policy_attachment.tfmigrate_apply_readonly will be destroyed
  # (because aws_iam_role_policy_attachment.tfmigrate_apply_readonly is not in configuration)
  - resource "aws_iam_role_policy_attachment" "tfmigrate_apply_readonly" {
      - id         = "GitHubActions_Terraform_AWS_tfmigrate_apply-20240310074515231500000005" -> null
      - policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess" -> null
      - role       = "GitHubActions_Terraform_AWS_tfmigrate_apply" -> null
    }

  # aws_iam_role_policy_attachment.tfmigrate_plan_readonly will be destroyed
  # (because aws_iam_role_policy_attachment.tfmigrate_plan_readonly is not in configuration)
  - resource "aws_iam_role_policy_attachment" "tfmigrate_plan_readonly" {
      - id         = "GitHubActions_Terraform_AWS_tfmigrate_plan-20240310074515461900000007" -> null
      - policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess" -> null
      - role       = "GitHubActions_Terraform_AWS_tfmigrate_plan" -> null
    }

  # aws_kms_key.ecr_kms will be created
  + resource "aws_kms_key" "ecr_kms" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = (known after apply)
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = (known after apply)
    }

  # module.aws.aws_iam_policy.put_terraform_state[0] will be destroyed
  # (because aws_iam_policy.put_terraform_state is not in configuration)
  - resource "aws_iam_policy" "put_terraform_state" {
      - arn       = "arn:aws:iam::839695154978:policy/GitHubActions_Terraform_AWS_write_terraform_state" -> null
      - id        = "arn:aws:iam::839695154978:policy/GitHubActions_Terraform_AWS_write_terraform_state" -> null
      - name      = "GitHubActions_Terraform_AWS_write_terraform_state" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::tfaction-state/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPA4HAN3H4RKQXYGOCAP" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.aws.aws_iam_policy.put_tfmigrate_history will be destroyed
  # (because aws_iam_policy.put_tfmigrate_history is not in configuration)
  - resource "aws_iam_policy" "put_tfmigrate_history" {
      - arn       = "arn:aws:iam::839695154978:policy/GitHubActions_Terraform_AWS_write_tfmigrate_history" -> null
      - id        = "arn:aws:iam::839695154978:policy/GitHubActions_Terraform_AWS_write_tfmigrate_history" -> null
      - name      = "GitHubActions_Terraform_AWS_write_tfmigrate_history" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::tfaction-history/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPA4HAN3H4RK5VCTTTCG" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.aws.aws_iam_policy.read_terraform_state[0] will be destroyed
  # (because aws_iam_policy.read_terraform_state is not in configuration)
  - resource "aws_iam_policy" "read_terraform_state" {
      - arn       = "arn:aws:iam::839695154978:policy/GitHubActions_Terraform_AWS_read_terraform_state" -> null
      - id        = "arn:aws:iam::839695154978:policy/GitHubActions_Terraform_AWS_read_terraform_state" -> null
      - name      = "GitHubActions_Terraform_AWS_read_terraform_state" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::tfaction-state/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::tfaction-state"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPA4HAN3H4RAOR3JWI4H" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.aws.aws_iam_policy.read_tfmigrate_history will be destroyed
  # (because aws_iam_policy.read_tfmigrate_history is not in configuration)
  - resource "aws_iam_policy" "read_tfmigrate_history" {
      - arn       = "arn:aws:iam::839695154978:policy/GitHubActions_Terraform_AWS_read_tfmigrate_history" -> null
      - id        = "arn:aws:iam::839695154978:policy/GitHubActions_Terraform_AWS_read_tfmigrate_history" -> null
      - name      = "GitHubActions_Terraform_AWS_read_tfmigrate_history" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::tfaction-history/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::tfaction-history"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPA4HAN3H4RMJJYRB25B" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.aws.aws_iam_role.terraform_apply will be destroyed
  # (because aws_iam_role.terraform_apply is not in configuration)
  - resource "aws_iam_role" "terraform_apply" {
      - arn                   = "arn:aws:iam::839695154978:role/GitHubActions_Terraform_AWS_terraform_apply" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                              - "token.actions.githubusercontent.com:sub" = "repo:boxp/arch:ref:refs/heads/main"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::839695154978:oidc-provider/token.actions.githubusercontent.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-03-10T07:45:13Z" -> null
      - force_detach_policies = false -> null
      - id                    = "GitHubActions_Terraform_AWS_terraform_apply" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::839695154978:policy/GitHubActions_Terraform_AWS_read_terraform_state",
          - "arn:aws:iam::839695154978:policy/GitHubActions_Terraform_AWS_write_terraform_state",
          - "arn:aws:iam::aws:policy/AdministratorAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "GitHubActions_Terraform_AWS_terraform_apply" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA4HAN3H4REIOYP6OAB" -> null
    }

  # module.aws.aws_iam_role.terraform_plan will be destroyed
  # (because aws_iam_role.terraform_plan is not in configuration)
  - resource "aws_iam_role" "terraform_plan" {
      - arn                   = "arn:aws:iam::839695154978:role/GitHubActions_Terraform_AWS_terraform_plan" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          - StringLike   = {
                              - "token.actions.githubusercontent.com:sub" = "repo:boxp/arch:*"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::839695154978:oidc-provider/token.actions.githubusercontent.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-03-10T07:45:13Z" -> null
      - force_detach_policies = false -> null
      - id                    = "GitHubActions_Terraform_AWS_terraform_plan" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::839695154978:policy/GitHubActions_Terraform_AWS_read_terraform_state",
          - "arn:aws:iam::aws:policy/ReadOnlyAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "GitHubActions_Terraform_AWS_terraform_plan" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA4HAN3H4RODXCWHFJD" -> null
    }

  # module.aws.aws_iam_role.tfmigrate_apply will be destroyed
  # (because aws_iam_role.tfmigrate_apply is not in configuration)
  - resource "aws_iam_role" "tfmigrate_apply" {
      - arn                   = "arn:aws:iam::839695154978:role/GitHubActions_Terraform_AWS_tfmigrate_apply" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                              - "token.actions.githubusercontent.com:sub" = "repo:boxp/arch:ref:refs/heads/main"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::839695154978:oidc-provider/token.actions.githubusercontent.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-03-10T07:45:13Z" -> null
      - force_detach_policies = false -> null
      - id                    = "GitHubActions_Terraform_AWS_tfmigrate_apply" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::839695154978:policy/GitHubActions_Terraform_AWS_read_terraform_state",
          - "arn:aws:iam::839695154978:policy/GitHubActions_Terraform_AWS_read_tfmigrate_history",
          - "arn:aws:iam::839695154978:policy/GitHubActions_Terraform_AWS_write_terraform_state",
          - "arn:aws:iam::839695154978:policy/GitHubActions_Terraform_AWS_write_tfmigrate_history",
          - "arn:aws:iam::aws:policy/ReadOnlyAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "GitHubActions_Terraform_AWS_tfmigrate_apply" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA4HAN3H4RCTHFFLAOP" -> null
    }

  # module.aws.aws_iam_role.tfmigrate_plan will be destroyed
  # (because aws_iam_role.tfmigrate_plan is not in configuration)
  - resource "aws_iam_role" "tfmigrate_plan" {
      - arn                   = "arn:aws:iam::839695154978:role/GitHubActions_Terraform_AWS_tfmigrate_plan" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          - StringLike   = {
                              - "token.actions.githubusercontent.com:sub" = "repo:boxp/arch:*"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::839695154978:oidc-provider/token.actions.githubusercontent.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-03-10T07:45:14Z" -> null
      - force_detach_policies = false -> null
      - id                    = "GitHubActions_Terraform_AWS_tfmigrate_plan" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::839695154978:policy/GitHubActions_Terraform_AWS_read_terraform_state",
          - "arn:aws:iam::839695154978:policy/GitHubActions_Terraform_AWS_read_tfmigrate_history",
          - "arn:aws:iam::aws:policy/ReadOnlyAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "GitHubActions_Terraform_AWS_tfmigrate_plan" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA4HAN3H4RGEN5ABDXS" -> null
    }

  # module.aws.aws_iam_role_policy_attachment.terraform_apply_put_terraform_state[0] will be destroyed
  # (because aws_iam_role_policy_attachment.terraform_apply_put_terraform_state is not in configuration)
  - resource "aws_iam_role_policy_attachment" "terraform_apply_put_terraform_state" {
      - id         = "GitHubActions_Terraform_AWS_terraform_apply-20240313174501058500000006" -> null
      - policy_arn = "arn:aws:iam::839695154978:policy/GitHubActions_Terraform_AWS_write_terraform_state" -> null
      - role       = "GitHubActions_Terraform_AWS_terraform_apply" -> null
    }

  # module.aws.aws_iam_role_policy_attachment.terraform_apply_read_terraform_state[0] will be destroyed
  # (because aws_iam_role_policy_attachment.terraform_apply_read_terraform_state is not in configuration)
  - resource "aws_iam_role_policy_attachment" "terraform_apply_read_terraform_state" {
      - id         = "GitHubActions_Terraform_AWS_terraform_apply-20240313174500894600000003" -> null
      - policy_arn = "arn:aws:iam::839695154978:policy/GitHubActions_Terraform_AWS_read_terraform_state" -> null
      - role       = "GitHubActions_Terraform_AWS_terraform_apply" -> null
    }

  # module.aws.aws_iam_role_policy_attachment.terraform_plan_read_terraform_state[0] will be destroyed
  # (because aws_iam_role_policy_attachment.terraform_plan_read_terraform_state is not in configuration)
  - resource "aws_iam_role_policy_attachment" "terraform_plan_read_terraform_state" {
      - id         = "GitHubActions_Terraform_AWS_terraform_plan-20240313174500902000000004" -> null
      - policy_arn = "arn:aws:iam::839695154978:policy/GitHubActions_Terraform_AWS_read_terraform_state" -> null
      - role       = "GitHubActions_Terraform_AWS_terraform_plan" -> null
    }

  # module.aws.aws_iam_role_policy_attachment.tfmigrate_apply_put_terraform_state[0] will be destroyed
  # (because aws_iam_role_policy_attachment.tfmigrate_apply_put_terraform_state is not in configuration)
  - resource "aws_iam_role_policy_attachment" "tfmigrate_apply_put_terraform_state" {
      - id         = "GitHubActions_Terraform_AWS_tfmigrate_apply-20240313174501045900000005" -> null
      - policy_arn = "arn:aws:iam::839695154978:policy/GitHubActions_Terraform_AWS_write_terraform_state" -> null
      - role       = "GitHubActions_Terraform_AWS_tfmigrate_apply" -> null
    }

  # module.aws.aws_iam_role_policy_attachment.tfmigrate_apply_put_tfmigrate_history will be destroyed
  # (because aws_iam_role_policy_attachment.tfmigrate_apply_put_tfmigrate_history is not in configuration)
  - resource "aws_iam_role_policy_attachment" "tfmigrate_apply_put_tfmigrate_history" {
      - id         = "GitHubActions_Terraform_AWS_tfmigrate_apply-20240310074515181800000001" -> null
      - policy_arn = "arn:aws:iam::839695154978:policy/GitHubActions_Terraform_AWS_write_tfmigrate_history" -> null
      - role       = "GitHubActions_Terraform_AWS_tfmigrate_apply" -> null
    }

  # module.aws.aws_iam_role_policy_attachment.tfmigrate_apply_read_terraform_state[0] will be destroyed
  # (because aws_iam_role_policy_attachment.tfmigrate_apply_read_terraform_state is not in configuration)
  - resource "aws_iam_role_policy_attachment" "tfmigrate_apply_read_terraform_state" {
      - id         = "GitHubActions_Terraform_AWS_tfmigrate_apply-20240313174500800600000001" -> null
      - policy_arn = "arn:aws:iam::839695154978:policy/GitHubActions_Terraform_AWS_read_terraform_state" -> null
      - role       = "GitHubActions_Terraform_AWS_tfmigrate_apply" -> null
    }

  # module.aws.aws_iam_role_policy_attachment.tfmigrate_apply_read_tfmigrate_history will be destroyed
  # (because aws_iam_role_policy_attachment.tfmigrate_apply_read_tfmigrate_history is not in configuration)
  - resource "aws_iam_role_policy_attachment" "tfmigrate_apply_read_tfmigrate_history" {
      - id         = "GitHubActions_Terraform_AWS_tfmigrate_apply-20240310074515185600000002" -> null
      - policy_arn = "arn:aws:iam::839695154978:policy/GitHubActions_Terraform_AWS_read_tfmigrate_history" -> null
      - role       = "GitHubActions_Terraform_AWS_tfmigrate_apply" -> null
    }

  # module.aws.aws_iam_role_policy_attachment.tfmigrate_plan_read_terraform_state[0] will be destroyed
  # (because aws_iam_role_policy_attachment.tfmigrate_plan_read_terraform_state is not in configuration)
  - resource "aws_iam_role_policy_attachment" "tfmigrate_plan_read_terraform_state" {
      - id         = "GitHubActions_Terraform_AWS_tfmigrate_plan-20240313174500821500000002" -> null
      - policy_arn = "arn:aws:iam::839695154978:policy/GitHubActions_Terraform_AWS_read_terraform_state" -> null
      - role       = "GitHubActions_Terraform_AWS_tfmigrate_plan" -> null
    }

  # module.aws.aws_iam_role_policy_attachment.tfmigrate_plan_read_tfmigrate_history will be destroyed
  # (because aws_iam_role_policy_attachment.tfmigrate_plan_read_tfmigrate_history is not in configuration)
  - resource "aws_iam_role_policy_attachment" "tfmigrate_plan_read_tfmigrate_history" {
      - id         = "GitHubActions_Terraform_AWS_tfmigrate_plan-20240310074515443500000006" -> null
      - policy_arn = "arn:aws:iam::839695154978:policy/GitHubActions_Terraform_AWS_read_tfmigrate_history" -> null
      - role       = "GitHubActions_Terraform_AWS_tfmigrate_plan" -> null
    }

Plan: 2 to add, 0 to change, 21 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":60,"Program":"tfcmt","SHA1":"25de4ac7af76b19e5d44d05b908eb0715f86d4af","Target":"terraform/aws/palserver","Vars":{},"WorkflowName":"pull_request_target"} -->